#不可重复，不可通过下标访问，无序的序列；与数学中集合类似，可以进行交、并、补运算; s = {直接输入}；s = set（iter）;frozenset为不可变集合
#集合中的元素必须是可哈希的：1，"abc",true，不能为列表、字典等
#当iter为字典的时候集合为key的集合
s = {1, 2, 3, 4, 1}
s = {x ** 2 for x in range(11) if x % 2 == 0}
# s = set(x ** 2 for x in range(11) if x % 2 == 0)
print(s, type(s))
s = {1, 2, 3, 4, 1}
s.add('5')
print(s)
#----------------------删除集合中元素---------------------------------------------------------
#s.remove(element):移除元素中element元素，若没有则报错
#s.discard(element):删除集合中element元素，没有则什么都不做
#s.pop():随机删除并返回一个集合中的元素，若集合为空，则报错
s = {1, 2, 3, 4, 1}
s.pop()
print(s)
s.pop()
print(s)
#s.clear（）：清空集合中所有元素
#----------------------遍历集合中元素---------------------------------------------------------
s = {1, 2, 3, 4, 1}
itr = iter(s)
for v in itr:
    print(v)

#----------------------集合的运算---------------------------------------------------------
#交集：s1.intersection(s2)  返回的集合类型同s1；s1 & s2
#并集:s1.union(s2) 返回并集；s1 | s2;(s1.update(s2)会更新s1)
#差集：s1.difference(s2)；s1 - s2;(difference_update()对象函数会更新原对象)

#----------------------集合的判断---------------------------------------------------------
#s1.isdisjoint(s2)  是够不相交
#s1.superset(s2) s1是否包含s2
#s1.subset(s2) s1是否为s2的子集